# 升序冒泡排序（有符号数）

.data                       # 数据段开始标记
    .align 2                # 对齐指令：将下一个数据的地址对齐到 2^2 = 4 字节边界
nums:                       # 数组标签，标记数组的起始位置
                            # 如需对更大的数进行比较，在下方将 .byte 改为 .word 等即可
    .byte 90, 109, 100, 8, 33, 105, 51, 7       # 1-8
    .byte 49, 96, 10, 1, 36, 15, 48, 97         # 9-16
    .byte 67, 98, 75, 66, 124, 69, 5, 19        # 17-24
    .byte 29, 9, 47, 74, 62, 93, 57, 82         # 25-32
    .byte 126, 24, 38, 111, 123, 70, 115, 110   # 33-40
    .byte 31, 84, 95, 103, 20, 94, 114, 92      # 41-48
    .byte 13, 81, 60, 28, 64, 2, 125, 32        # 49-56
    .byte 86, 76, 25, 58, 18, 39, 113, 44       # 57-64
    .byte 21, 26, 50, 120, 12, 30, 61, 89       # 65-72
    .byte 77, 16, 72, 27, 73, 53, 122, 46       # 73-80
    .byte 116, 87, 88, 54, 79, 118, 17, 91      # 81-88
    .byte 112, 55, 83, 65, 108, 121, 99, 101    # 89-96
    .byte 71, 85, 107, 52, 23, 117, 41, 104     # 97-104
    .byte 14, 127, 102, 40, 80, 6, 3, 11        # 105-112
    .byte 42, 119, 0, 106, 4, 68, 45, 37        # 113-120
    .byte 22, 34, 63, 35, 43, 56, 59, 78        # 121-128

    
length:                     # 长度标签，标记数组长度变量的位置
    .word 128               # 数组长度

.text                       # 代码段开始标记
.globl main                 # 声明 main 标签为全局可见，可以被链接器找到

main:                       # 程序入口点
    la a0, nums             # la(Load Address)：加载 nums 标签的地址到寄存器 a0
    lw t0, length           # 加载数组长度
    addi t0, t0, -1         # 最后一个元素的索引，同时也是外层循环的上限

    li t1, 0                # 外层循环变量，从 0 递增到 127
    # li t2, 127              # 内层循环变量，从 127 递减到 i+1
outer_loop:
    bge t1, t0, sort_finish # 循环跳出条件：t1 >= 127

    li t2, 127              # 内层循环变量，从 127 递减到 t1+1

inner_loop:
    bge t1, t2, inner_finish    # 循环跳出条件：t2 <= t1

    add t4, a0, t2
    lb t5, 0(t4)            # 读取 nums[t2]
    lb t6, -1(t4)           # 读取 nums[t2-1]
    blt t5, t6, no_swap     # 若 nums[t2] < nums[t2-1]，则进行交换
                            # 如需改为降序，在此处交换 t5 和 t6 的参数位置即可
                            # 如需改为无符号数比较，在此处将 blt 改为 bltu 即可
    sb t5, -1(t4)
    sb t6, 0(t4)

no_swap:
    addi t2, t2, -1         # 内层循环变量自减
    j inner_loop

inner_finish:
    addi t1, t1, 1          # 外层循环变量自增
    j outer_loop

sort_finish:
    ebreak
